wintersmith/contents/articles/Network/2015-03-11-linux-tcp-tunning.html
---
date: 2015-03-11 22:05:08
template: tech.jade
title: Linux Tcp 参数调优
category: Network
chage_frequency: monthly
tag: Linux
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">半连接</a></li>
<li><a href="#sec-2">网络分片与重组</a>
<ul>
<li><a href="#sec-2-1">link 层 —— Frame</a></li>
<li><a href="#sec-2-2">ip 层</a></li>
<li><a href="#sec-2-3">tcp 层</a></li>
<li><a href="#sec-2-4">tcp_mtu_probing</a></li>
<li><a href="#sec-2-5">tcp_base_mss</a></li>
</ul>
</li>
<li><a href="#sec-3">新建链接</a>
<ul>
<li><a href="#sec-3-1">tcp_max_syn_backlog</a></li>
<li><a href="#sec-3-2">somaxconn</a></li>
<li><a href="#sec-3-3">tcp_synack_retries</a></li>
<li><a href="#sec-3-4">tcp_syncookies</a></li>
<li><a href="#sec-3-5">tcp_syn_retries</a></li>
<li><a href="#sec-3-6">tcp_abort_on_overflow</a></li>
</ul>
</li>
<li><a href="#sec-4">传输过程中</a>
<ul>
<li><a href="#sec-4-1">tcp_window_scaling</a></li>
<li><a href="#sec-4-2">tcp_congestion_control</a></li>
<li><a href="#sec-4-3">tcp_retrans_collapse</a></li>
<li><a href="#sec-4-4">tcp_retries1</a></li>
<li><a href="#sec-4-5">tcp_retries2</a></li>
</ul>
</li>
<li><a href="#sec-5">链接断开</a>
<ul>
<li><a href="#sec-5-1">tcp_orphan_reties</a></li>
<li><a href="#sec-5-2">tcp_max_orphans</a></li>
<li><a href="#sec-5-3">tcp_fin_timeout</a></li>
<li><a href="#sec-5-4">tcp_tw_recycle = 0</a></li>
<li><a href="#sec-5-5">tcp_tw_reuse = 0</a></li>
<li><a href="#sec-5-6">tcp_timestamps = 0</a></li>
<li><a href="#sec-5-7">nf_conntrack_tcp_timeout_time_wait</a></li>
<li><a href="#sec-5-8">tcp_max_tw_buckets</a></li>
</ul>
</li>
<li><a href="#sec-6">缓冲区</a>
<ul>
<li><a href="#sec-6-1">tcp_mem</a></li>
<li><a href="#sec-6-2">net.core.rmem_default</a></li>
<li><a href="#sec-6-3">net.core.rmem_max</a></li>
<li><a href="#sec-6-4">net.core.wmem_default</a></li>
<li><a href="#sec-6-5">net.core.wmem_max</a></li>
<li><a href="#sec-6-6">tcp_rmem</a></li>
<li><a href="#sec-6-7">tcp_wmem</a></li>
</ul>
</li>
<li><a href="#sec-7">Keepalive</a>
<ul>
<li><a href="#sec-7-1">tcp_keepalive_time</a></li>
<li><a href="#sec-7-2">tcp_keepalive_intvl</a></li>
<li><a href="#sec-7-3">tcp_keepalive_probes</a></li>
</ul>
</li>
<li><a href="#sec-8">port</a>
<ul>
<li><a href="#sec-8-1">ip_local_port_range</a></li>
<li><a href="#sec-8-2">ip_local_reserved_ports</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
TCP 参数在这里做一个汇总，和清楚明白的说明，希望能够指导进行网络程序优化，同时做一个备忘。
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">半连接</h2>
<div class="outline-text-2" id="text-1">
<p>
半连接可以指握手还没有结束，或者挥手还没有结束。
</p>

<p>
在挥手还没有结束的适合，发出fin包得一方不再能发送数据，但是还是可以收到对方发来的数据。
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">网络分片与重组</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">link 层 —— Frame</h3>
<div class="outline-text-3" id="text-2-1">
<p>
1542 byte
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">ip 层</h3>
<div class="outline-text-3" id="text-2-2">
<p>
MTU : max transimit Unit —— 1500 byte
</p>

<ul class="org-ul">
<li>ip 会进行重组, 在到达目标主机的时候，向上层发出之前重组。
</li>
<li>网络中的路由器可能对于大于自己支持MTU的报文进行丢失，因为重组后，切片影响性能。
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">tcp 层</h3>
<div class="outline-text-3" id="text-2-3">
<p>
MSS : max segment size —— 1460
tcp 是面向字节流的，一个tcp报文最大传输的大小由此参数控制，MSS在主机上面配置。
</p>

<p>
UDP 面向数据报，不会分段。
</p>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">tcp_mtu_probing</h3>
<div class="outline-text-3" id="text-2-4">
<p>
tcp 层面的mtu发现（PLPMTUD），初始tcp MSS 为 <i>tcp_base_mss</i>
</p>
</div>
</div>
<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5">tcp_base_mss</h3>
<div class="outline-text-3" id="text-2-5">
<p>
初次尝试的mss大小（512）,不断增大
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">新建链接</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">tcp_max_syn_backlog</h3>
<div class="outline-text-3" id="text-3-1">
<p>
半链接缓冲队列长度。指还没有收到ack的连接
</p>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">somaxconn</h3>
<div class="outline-text-3" id="text-3-2">
<p>
处于listen状态单个端口上面accept队列长度。
</p>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">tcp_synack_retries</h3>
<div class="outline-text-3" id="text-3-3">
<p>
链接被动打开方的确认链接的应答最大重试次数。
</p>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4">tcp_syncookies</h3>
<div class="outline-text-3" id="text-3-4">
<p>
开启此功能，防止sync flood攻击，在将链接加入syn_backlog之前先发出syn并带上cookies。
</p>
</div>
</div>
<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5">tcp_syn_retries</h3>
<div class="outline-text-3" id="text-3-5">
<p>
链接主动打开方的syn尝试次数
</p>
</div>
</div>
<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6">tcp_abort_on_overflow</h3>
<div class="outline-text-3" id="text-3-6">
<p>
如果上层accept应用无法处理过来，就对新来的connection直接rst。
</p>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">传输过程中</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">tcp_window_scaling</h3>
<div class="outline-text-3" id="text-4-1">
<p>
调整window大小，针对更大的tcp报文——大于64k。
</p>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2">tcp_congestion_control</h3>
<div class="outline-text-3" id="text-4-2">
<p>
拥塞控制算法。默认的算法是慢启动——线性增大，快减少——重传超时指数后退，丢包重传减半。
</p>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3">tcp_retrans_collapse</h3>
<div class="outline-text-3" id="text-4-3">
<p>
重传合并
</p>
</div>
</div>
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4">tcp_retries1</h3>
<div class="outline-text-3" id="text-4-4">
<p>
进行重传的次数，超过这个次数后进入第二阶段的重传，这个阶段假设网络是ok的
</p>
</div>
</div>
<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5">tcp_retries2</h3>
<div class="outline-text-3" id="text-4-5">
<p>
第二阶段的重传，重传次数增加。
</p>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">链接断开</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">tcp_orphan_reties</h3>
<div class="outline-text-3" id="text-5-1">
<p>
探测对端已经close的次数
</p>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2">tcp_max_orphans</h3>
<div class="outline-text-3" id="text-5-2">
<p>
最大孤儿socket，孤儿socket没有与fd关联，每个孤儿socket会占用64k不可交换内存。
</p>
</div>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3">tcp_fin_timeout</h3>
<div class="outline-text-3" id="text-5-3">
<p>
处于FIN2_WAIT时等待对方发送FIN包得时间，单位是秒，默认60s，超过此时间强制关闭连接。
</p>
</div>
</div>
<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4">tcp_tw_recycle = 0</h3>
<div class="outline-text-3" id="text-5-4">
<p>
启用  <code>TIME_WAIT</code>  状态SOCKET的回收，更激进的重复使用 <code>TIME_WAIT</code> 状态的SOCKET，对于处于NAT和LB等设备后面经过地址转换的链接，不要使用此选项，否则会出现新建链接被RST的情况。
</p>

<p>
这是因为NAT设备后的多个地址使用了同一个nat后的地址，而Server端如果发现小于一定时间间隔的新建链接，认为是错误的，会RST掉。
</p>
</div>
</div>
<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5">tcp_tw_reuse = 0</h3>
<div class="outline-text-3" id="text-5-5">
<p>
重新利用 <code>TIME_WAIT</code> 状态的SOCKET，提高socket的使用率，避免耗尽。依赖 <code>tcp_timestamps</code> option来防止冲突，保证正确性。
</p>
</div>
</div>
<div id="outline-container-sec-5-6" class="outline-3">
<h3 id="sec-5-6">tcp_timestamps = 0</h3>
<div class="outline-text-3" id="text-5-6">
<p>
<code>tcp_tw_recycle</code> 与 <code>tcp_tw_reuse</code> 都依赖此特性，这个选项是让通信双方都加上时间戳，能够避免冲突。
</p>
</div>
</div>
<div id="outline-container-sec-5-7" class="outline-3">
<h3 id="sec-5-7">nf_conntrack_tcp_timeout_time_wait</h3>
<div class="outline-text-3" id="text-5-7">
<p>
<code>time_wait</code> 时长
</p>
</div>
</div>
<div id="outline-container-sec-5-8" class="outline-3">
<h3 id="sec-5-8">tcp_max_tw_buckets</h3>
<div class="outline-text-3" id="text-5-8">
<p>
最大tw状态的链接数，超过这个数字，tw的状态链接被直接丢弃。设置这个值为了防止攻击造成SOCKET被大量 <code>TIME_WAIT</code> 占用。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">缓冲区</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1">tcp_mem</h3>
<div class="outline-text-3" id="text-6-1">
<p>
tcp 内存总页面数量，分别是［low，watermark，hight］，这是全局内存的限制，在boot time计算得到。
</p>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2">net.core.rmem_default</h3>
<div class="outline-text-3" id="text-6-2">
<p>
读缓冲的大小 —— per connection
</p>
</div>
</div>
<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3">net.core.rmem_max</h3>
<div class="outline-text-3" id="text-6-3">
<p>
最大值 —— per connection
</p>
</div>
</div>
<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4">net.core.wmem_default</h3>
<div class="outline-text-3" id="text-6-4">
<p>
写缓冲的大小
</p>
</div>
</div>
<div id="outline-container-sec-6-5" class="outline-3">
<h3 id="sec-6-5">net.core.wmem_max</h3>
<div class="outline-text-3" id="text-6-5">
<p>
最大值
</p>
</div>
</div>
<div id="outline-container-sec-6-6" class="outline-3">
<h3 id="sec-6-6">tcp_rmem</h3>
<div class="outline-text-3" id="text-6-6">
<p>
tcp receive buffer size &#x2013; Per connection.
</p>
</div>
</div>
<div id="outline-container-sec-6-7" class="outline-3">
<h3 id="sec-6-7">tcp_wmem</h3>
<div class="outline-text-3" id="text-6-7">
<p>
tcp send buffer size &#x2013; Per connection.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Keepalive</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1">tcp_keepalive_time</h3>
<div class="outline-text-3" id="text-7-1">
<p>
多久没有数据就开始进行probe来探测链接的活跃
</p>
</div>
</div>
<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2">tcp_keepalive_intvl</h3>
<div class="outline-text-3" id="text-7-2">
<p>
probe 重试间隔
</p>
</div>
</div>
<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3">tcp_keepalive_probes</h3>
<div class="outline-text-3" id="text-7-3">
<p>
连续探测多少次都失败后就认为链接断裂了。然后关闭。
</p>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">port</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1">ip_local_port_range</h3>
<div class="outline-text-3" id="text-8-1">
<p>
本地(local)端口范围，每个主动发起的tcp链接，就会选择一个端口来与远端链接，如果端口都用完了，就建立链接失败。
</p>
</div>
</div>
<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2">ip_local_reserved_ports</h3>
<div class="outline-text-3" id="text-8-2">
<p>
保留的本地端口，在选择端口的时候，排除这些端口。这些端口一般给本地的服务器程序预留。从而避免被client类型程序占用。
</p>
</div>
</div>
</div>
